Ryujiyasu/dragon-radar/dragon-radar/firmware/esp32-p4/sdkconfig.defaults
# Dragon Radar - ESP32-P4-WIFI6-Touch-LCD-3.4C (Waveshare, v1.3 silicon)
# Tuned to fit in IRAM/sdata on chip rev v1.x.

# --- Target ---
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESP32P4_SELECTS_REV_LESS_V3=y
CONFIG_ESP32P4_REV_MIN_1=y

# --- Flash / Partition ---
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- Compiler / FreeRTOS / Memory ---
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144
CONFIG_FREERTOS_HZ=1000

# --- PSRAM (8MB Octal, 200MHz) ---
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
# Disable XIP-from-PSRAM on v1.x silicon (too much IRAM reservation)
# CONFIG_SPIRAM_XIP_FROM_PSRAM is not set
CONFIG_CACHE_L2_CACHE_128KB=y
CONFIG_CACHE_L2_CACHE_LINE_64B=y

# --- LVGL 9 (minimal, no extra demos/perf monitor) ---
CONFIG_LV_USE_CLIB_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_DEF_REFR_PERIOD=15
CONFIG_LV_OS_FREERTOS=y
CONFIG_LV_DRAW_SW_DRAW_UNIT_CNT=1
# CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM is not set
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_TXT_BREAK_CHARS=" ,.;:-_"
# CONFIG_LV_USE_SYSMON is not set
# CONFIG_LV_USE_PERF_MONITOR is not set
# CONFIG_LV_USE_FONT_COMPRESSED is not set

# --- Required by Waveshare BSP ---
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# --- FATFS for microSD (long filenames OK) ---
CONFIG_FATFS_LFN_HEAP=y
